xqoperator/EMS-ESP32/src/core/system.cpp
    version::Semver200_version settings_version(settingsVersion);
    version::Semver200_version this_version(EMSESP_APP_VERSION);

    std::string settings_version_type = settings_version.prerelease().empty() ? "" : ("-" + settings_version.prerelease());
    std::string this_version_type     = this_version.prerelease().empty() ? "" : ("-" + this_version.prerelease());
    bool        save_version          = true;
    bool        reboot_required       = false;

    LOG_DEBUG("Checking for version upgrades from v%d.%d.%d%s",
              settings_version.major(),
              settings_version.minor(),
              settings_version.patch(),
              settings_version_type.c_str());

    // compare versions
    if (this_version > settings_version) {
        // we need to do an upgrade
        if (missing_version) {
            LOG_NOTICE("Upgrading to version %d.%d.%d%s", this_version.major(), this_version.minor(), this_version.patch(), this_version_type.c_str());
        } else {
            LOG_NOTICE("Upgrading from version %d.%d.%d%s to %d.%d.%d%s",
                       settings_version.major(),
                       settings_version.minor(),
                       settings_version.patch(),
                       settings_version_type.c_str(),
                       this_version.major(),
                       this_version.minor(),
                       this_version.patch(),
                       this_version_type.c_str());
        }

        // if we're coming from 3.4.4 or 3.5.0b14 which had no version stored then we need to apply new settings
        if (missing_version) {
            LOG_INFO("Upgrade: Setting MQTT Entity ID format to older v3.4 format (0)");
            EMSESP::esp32React.getMqttSettingsService()->update([&](MqttSettings & mqttSettings) {
                mqttSettings.entity_format = Mqtt::entityFormat::SINGLE_LONG; // use old Entity ID format from v3.4
                return StateUpdateResult::CHANGED;
            });
        } else if (settings_version.major() == 3 && settings_version.minor() <= 6) {
            EMSESP::esp32React.getMqttSettingsService()->update([&](MqttSettings & mqttSettings) {
                if (mqttSettings.entity_format == 1) {
                    mqttSettings.entity_format = Mqtt::entityFormat::SINGLE_OLD; // use old Entity ID format from v3.6
                    LOG_INFO("Upgrade: Setting MQTT Entity ID format to v3.6 format (3)");
                    return StateUpdateResult::CHANGED;
                } else if (mqttSettings.entity_format == 2) {
                    mqttSettings.entity_format = Mqtt::entityFormat::MULTI_OLD; // use old Entity ID format from v3.6
                    LOG_INFO("Upgrade: Setting MQTT Entity ID format to v3.6 format (4)");
                    return StateUpdateResult::CHANGED;
                }
                return StateUpdateResult::UNCHANGED;
            });
        }

        // changes pre < v3.7.0
        if (settings_version.major() == 3 && settings_version.minor() < 7) {
            // network changes
            // 1) WiFi Tx Power is now using the value * 4 (was 20)
            // 2) WiFi sleep is now off by default (was on)
            EMSESP::esp32React.getNetworkSettingsService()->update([&](NetworkSettings & networkSettings) {
                auto changed = StateUpdateResult::UNCHANGED;
                if (networkSettings.tx_power == 20) {
                    networkSettings.tx_power = WIFI_POWER_19_5dBm; // use 19.5 as we don't have 20 anymore
                    LOG_INFO("Upgrade: Setting WiFi TX Power to Auto");
                    changed = StateUpdateResult::CHANGED;
                }
                if (networkSettings.nosleep != true) {
                    networkSettings.nosleep = true;
                    LOG_INFO("Upgrade: Disabling WiFi nosleep");
                    changed = StateUpdateResult::CHANGED;
                }
                return changed;
            });
        }

        // changes to application settings
        EMSESP::webSettingsService.update([&](WebSettings & settings) {
            // force web buffer to 25 for those boards without psram
            if ((EMSESP::system_.PSram() == 0) && (settings.weblog_buffer != 25)) {
                settings.weblog_buffer = 25;
                return StateUpdateResult::CHANGED;
            }
            return StateUpdateResult::UNCHANGED;
        });
    } else if (this_version < settings_version) {
        // downgrading
        LOG_NOTICE("Downgrading from version %d.%d.%d%s to version %d.%d.%d%s",
                   settings_version.major(),
                   settings_version.minor(),
                   settings_version.patch(),
                   settings_version_type.c_str(),
                   this_version.major(),
                   this_version.minor(),
                   this_version.patch(),
                   this_version_type.c_str());
    } else {
        save_version = false; // same version, do nothing
    }

    // if we did a change, set the new version and save it, no need to reboot
    if (save_version) {
        EMSESP::webSettingsService.update([&](WebSettings & settings) {
            settings.version = EMSESP_APP_VERSION;
            LOG_DEBUG("Upgrade: Setting version to %s", EMSESP_APP_VERSION);
            return StateUpdateResult::CHANGED;
        });
    }

    if (reboot_required) {
        LOG_INFO("Upgrade: Rebooting to apply changes");
        return true; // need reboot
    }

    return false; // no reboot required
}

// convert settings file into json object
void System::extractSettings(const char * filename, const char * section, JsonObject output) {
#ifndef EMSESP_STANDALONE
    File settingsFile = LittleFS.open(filename);
    if (settingsFile) {
        JsonDocument         jsonDocument;
        DeserializationError error = deserializeJson(jsonDocument, settingsFile);
        if (error == DeserializationError::Ok && jsonDocument.is<JsonObject>()) {
            JsonObject jsonObject = jsonDocument.as<JsonObject>();
            JsonObject node       = output[section].to<JsonObject>();
            for (JsonPair kvp : jsonObject) {
                node[kvp.key()] = kvp.value();
            }
        }
    }
    settingsFile.close();
#endif
}

