xqoperator/EMS-ESP32/src/core/system.cpp
    // if exclude list is provided, parse it and remove excluded GPIOs
    if (!exclude.empty()) {
        std::vector<uint8_t, AllocatorPSRAM<uint8_t>> exclude_gpios;
        pos  = 0;
        prev = 0;

        auto process_exclude = [&exclude_gpios](std::string part) {
            // trim whitespace
            part.erase(0, part.find_first_not_of(" \t"));
            part.erase(part.find_last_not_of(" \t") + 1);

            // check if it's a range (contains '-')
            std::string::size_type dash_pos = part.find('-');
            if (dash_pos != std::string::npos) {
                // it's a range like "6-11"
                int start = std::stoi(part.substr(0, dash_pos));
                int end   = std::stoi(part.substr(dash_pos + 1));
                for (int i = start; i <= end; i++) {
                    exclude_gpios.push_back(static_cast<uint8_t>(i));
                }
            } else {
                exclude_gpios.push_back(static_cast<uint8_t>(std::stoi(part)));
            }
        };

        while ((pos = exclude.find(',', prev)) != std::string::npos) {
            process_exclude(exclude.substr(prev, pos - prev));
            prev = pos + 1;
        }

        // handle the last part
        process_exclude(exclude.substr(prev));

        // remove excluded GPIOs from the main list
        gpios.erase(std::remove_if(gpios.begin(),
                                   gpios.end(),
                                   [&exclude_gpios](uint8_t gpio) { return std::find(exclude_gpios.begin(), exclude_gpios.end(), gpio) != exclude_gpios.end(); }),
                    gpios.end());
    }

    return gpios;
}

// initialize a list of valid GPIOs based on the ESP32 board
// string_to_vector() take two strings, the first is the range of GPIOs to use, the second is a list of GPIOs to exclude
// notes:
//   we always allow 0 (which is usually a strapping pin), because it's used to indicate whether EMS-ESP Dallas or the LED is disabled
//   we allow UART0, 1 and 2 as they are configurable
//   strapping pins are disabled as they can affect boot behaviour
//   we accept GPIOs that are fixed on BBQKees boards
//
void System::set_valid_system_gpios() {
    valid_system_gpios_.clear(); // reset system list
    used_gpios_.clear();         // reset used list

    // get free gpios based on board/platform type
#if CONFIG_IDF_TARGET_ESP32C3
    // https://docs.espressif.com/projects/esp-idf/en/stable/esp32c3/api-reference/peripherals/gpio.html
    // excluded:
    // GPIO2, GPIO8 - GPIO9 = strapping pins
    // GPIO12 - GPIO17 = used for SPI flash and PSRAM
    // GPIO18 - GPIO19 = USB-JTAG
    //
    // notes on what is allowed:
    // GPIO09 = button on BOARD_C3_MINI_V1
    // GPIO20 - GPIO21 = UART0, , no chip connected because native USB
    valid_system_gpios_ = string_range_to_vector("0-21", "2, 8, 12-17, 18-19");

#elif CONFIG_IDF_TARGET_ESP32S2
    // https://docs.espressif.com/projects/esp-idf/en/stable/esp32s2/api-reference/peripherals/gpio.html
    // excluded:
    // GPIO26 - GPIO32 = SPI flash and PSRAM
    // GPIO45 - GPIO46 = strapping pins
    // GPIO39 - GPIO42 = USB-JTAG
    // GPIO22 - GPIO25 = don't exist
    // GPIO19 - GPIO20 = USB
    //
    // notes on what is allowed:
    // GPIO43, GPIO44 = UART0, no chip connected because native USB
    valid_system_gpios_ = string_range_to_vector("0-46", "19, 20, 26-32, 45-46, 39-42, 22-25");

#elif CONFIG_IDF_TARGET_ESP32S3
    // https://docs.espressif.com/projects/esp-idf/en/stable/esp32s3/api-reference/peripherals/gpio.html
    // excluded:
    // GPIO3, GPIO45 - GPIO46 = strapping pins
    // GPIO26 - GPIO32 = SPI flash and PSRAM and not recommended
    // GPIO33 - GPIO37 = Octal flash/PSRAM
    // GPIO19 - GPIO20 = USB-JTAG
    // GPIO22 - GPIO25 = don't exist
    //
    // notes on what is allowed:
    // GPIO11 - GPIO19 = ADC analog input only pins
    // GPIO47 - GPIO48 = valid on a Wemos S3
    // GPIO8 = used by Liligo S3 board profile for Rx

    // GPIO46 - buzzer
#ifdef TWI_EXPANDER
    // GPIO100-107 twi expander
    valid_system_gpios_ = string_range_to_vector("0-48,100-107", "3, 45, 26-32, 33-37, 19-20, 22-25");
#else
    valid_system_gpios_ = string_range_to_vector("0-48", "3, 45, 26-32, 33-37, 19-20, 22-25");
#endif

#elif CONFIG_IDF_TARGET_ESP32
    // https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/peripherals/gpio.html
    // excluded:
    // GPIO6 - GPIO11, GPIO16 - GPIO17 = used for SPI flash and PSRAM (dio mode only GPIO06-GPIO08, GPIO11)
    // GPIO20, GPIO24, GPIO28 - GPIO31 = don't exist
    // GPIO01, GPIO03 = UART0, normal connected to UART/USB chip
    //
    // notes on known boards:
    // boards have valid gpios depending on pinout and internal used gpios, see: `load_board_profile()`
    //
    // notes on BBQKees boards:
    // *** We block all free GPIOS in load_board_profile() ***
    // GPIO2, GPIO4, GPIO5, GPIO14 = used on BBQKees boards for either LED, Dallas or Rx
    // GPIO12, GPIO13, GPIO35 = BBQKees E32V2_2 internal system pins
    // GPIO33 = BBQKees E32V_2 unused internal NTC system sensor
    // GPIO36 = used on BBQKees boards for supply_voltage (E32V2.2)
    // GPIO39 = used on BBQKees boards for core_voltage (E32V2.2)
    //
    // notes on what is allowed with special functions:
    // GPIO01, GPIO03 = UART0, not always connected to uart/usb chip
    // GPIO12 - GPIO15 = JTAG, normally not used
    // GPIO00, GPIO05, GPIO12, GPIO15 = strapping pins, can be used with care
    // GPIO34, GPIO35, GPIO37 = input only
    // GPIO23 and GPIO18 are used by Ethernet, excluded later by eth config
    // GPIO00, GPIO02, GPIO04, GPIO12 - GPIO15, GPIO25 - GPIO27 = ADC2 (10 ch), used by WiFI-driver
    // GPIO32 - GPIO39 = ADC1 (8 ch), can always be used
    if (ESP.getPsramSize() > 0) {
        // remove SPI0/1 PSRAM pins GPIO16 (CS) and GPIO17 (CLK) from the list
        valid_system_gpios_ = string_range_to_vector("0-39", "6-11, 16, 17, 20, 24, 28-31");
    } else {
        valid_system_gpios_ = string_range_to_vector("0-39", "6-11, 20, 24, 28-31");
    }
#elif defined(EMSESP_STANDALONE)
    valid_system_gpios_ = string_range_to_vector("0-39");
#endif
    valid_system_gpios_.shrink_to_fit();
}

// check if a pin is valid ESP32 pin and if not already used, add to the used gpio list
// return false if not allowed or already used
bool System::add_gpio(uint8_t pin, const char * source_name) {
    // check if this is a valid user GPIO
    if (std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin) != valid_system_gpios_.end()) {
        // It's valid now check if it's already in the used list
        auto it = std::find_if(used_gpios_.begin(), used_gpios_.end(), [pin](const GpioUsage & usage) { return usage.pin == pin; });
        if (it != used_gpios_.end()) {
            LOG_WARNING("GPIO %d for %s is already in use by %s", pin, source_name, it->source.c_str());
            return false; // Pin is already used
        }
    } else {
        // not valid
        LOG_WARNING("GPIO %d for %s is not valid", pin, source_name);
        return false;
    }

    // remove the old pin, if exists from used list
    remove_gpio(pin);

    LOG_DEBUG("Adding GPIO %d for %s to used gpio list", pin, source_name);
    used_gpios_.push_back({pin, source_name}); // add to used list

